# Brain Stroke Analysis with SQL

# About Dataset

A stroke is a medical condition in which poor blood flow to the brain causes cell death. There are two main types of stroke: ischemic, due to lack of blood flow, and hemorrhagic, due to bleeding. Both cause parts of the brain to stop functioning properly. Signs and symptoms of a stroke may include an inability to move or feel on one side of the body, problems understanding or speaking, dizziness, or loss of vision to one side. Signs and symptoms often appear soon after the stroke has occurred. If symptoms last less than one or two hours, the stroke is a transient ischemic attack (TIA), also called a mini-stroke. A hemorrhagic stroke may also be associated with a severe headache. The symptoms of a stroke can be permanent. Long-term complications may include pneumonia and loss of bladder control.

The main risk factor for stroke is high blood pressure. Other risk factors include high blood cholesterol, tobacco smoking, obesity, diabetes mellitus, a previous TIA, end-stage kidney disease, and atrial fibrillation. An ischemic stroke is typically caused by blockage of a blood vessel, though there are also less common causes. A hemorrhagic stroke is caused by either bleeding directly into the brain or into the space between the brain's membranes. Bleeding may occur due to a ruptured brain aneurysm. Diagnosis is typically based on a physical exam and is supported by medical imaging such as a CT scan or MRI scan. A CT scan can rule out bleeding, but may not necessarily rule out ischemia, which early on typically does not show up on a CT scan. Other tests such as an electrocardiogram (ECG) and blood tests are done to determine risk factors and rule out other possible causes. Low blood sugar may cause similar symptoms.

Prevention includes decreasing risk factors, surgery to open up the arteries to the brain in those with problematic carotid narrowing, and warfarin in people with atrial fibrillation. Aspirin or statins may be recommended by physicians for prevention. A stroke or TIA often requires emergency care. An ischemic stroke, if detected within three to four and half hours, may be treatable with a medication that can break down the clot. Some hemorrhagic strokes benefit from surgery. Treatment to attempt recovery of lost function is called stroke rehabilitation, and ideally takes place in a stroke unit; however, these are not available in much of the world.

Attribute Information
1) gender: "Male", "Female" or "Other"
2) age: age of the patient
3) hypertension: 0 if the patient doesn't have hypertension, 1 if the patient has hypertension
4) heart disease: 0 if the patient doesn't have any heart diseases, 1 if the patient has a heart disease 
5) ever-married: "No" or "Yes"
6) worktype: "children", "Govtjov", "Neverworked", "Private" or "Self-employed" 7) Residencetype: "Rural" or "Urban"
8) avgglucoselevel: average glucose level in blood
9) bmi: body mass index
10) smoking_status: "formerly smoked", "never smoked", "smokes" or "Unknown"*
11) stroke: 1 if the patient had a stroke or 0 if not

IMPORTING LIBRARIES

In [29]:
import pandas as pd
import sqlite3 as sq

CREATING THE DATABASE

In [30]:
conn = sq.connect('brain_stroke.db')

CREATING A TABLE CALLED BRAIN STROKE INSIDE THE DATABASE

In [31]:
query = """
CREATE TABLE BRAIN_STROKE(
    gender VARCHAR(10),
    age DECIMAL (2,2),
    hypertension SMALLINT,
    heart_disease SMALLINT,
    ever_married VARCHAR (5),
    work_type VARCHAR (20),
    Residence_type VARCHAR (10),
    avg_glucose_level DECIMAL (5,3),
    bmi DECIMAL (4,3),
    smoking_status VARCHAR (20),
    stroke SMALLINT
    )
"""
with conn:
    cur = conn.cursor()
    cur.execute('DROP TABLE IF EXISTS BRAIN_STROKE')
    cur.execute(query)

CHECKING OUR SQLITE MASTER FOR CONFIRMATION

In [32]:
query = "SELECT name FROM sqlite_master WHERE type = 'table'"
cur.execute(query)
cur.fetchall()

[('BRAIN_STROKE',)]

LOADING OUR CSV FILE

In [33]:
brain_stroke_df = pd.read_csv('C:/Users/CHINELO/Downloads/brain_stroke.csv')
brain_stroke_df.head()

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
2,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
3,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
4,Male,81.0,0,0,Yes,Private,Urban,186.21,29.0,formerly smoked,1

CONVERTING CSV FILE INTO TUPLE BEFORE LOADING INTO DATABASE

In [34]:
csv_tuple = tuple(brain_stroke_df.itertuples(index=False, name=None))
csv_tuple[0]

('Male',
 67.0,
 0,
 1,
 'Yes',
 'Private',
 'Urban',
 228.69,
 36.6,
 'formerly smoked',
 1)

INSERTING VALUES INTO DATABASE TABLE

In [35]:
query = "INSERT INTO BRAIN_STROKE VALUES (?,?,?,?,?,?,?,?,?,?,?)"
cur.executemany(query, csv_tuple)

In [36]:
query = "SELECT * FROM BRAIN_STROKE LIMIT 5"

In [37]:
pd.read_sql_query(query, conn)

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Male,67,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,Male,80,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
2,Female,49,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
3,Female,79,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
4,Male,81,0,0,Yes,Private,Urban,186.21,29.0,formerly smoked,1

Questions
1.  What is the distribution of gender in the dataset?
2.  What is the distribution of people with stroke in the dataset?
3.  What is the distribution of brain stroke by gender?
4.  For women, how many percent has stroke?
5.  For men, how many percent has no stroke?
6.  Details of the oldest people with stroke
7.  How many people are married and has stroke?
8.  How many people are not married and has stroke?
9.  What is the minimum, average and maximum age in the data?
10. Details of people in the dataset below 10 years
11. Number of children with either hypertension or stroke
12. What's the distibution of hypertension in the dataset?
13. How many male, and female has hypertension?
14. For each smoking status show how many people have hypertension and how many do not?
15. How many male, and female has both hypertension and heart disease?
16. Which residence has the lowest number of people with no heart disease?
17. How many percent of people with private work type has no hypertension?

1. What is the distribution of gender in the dataset?

In [38]:
query = """
SELECT    gender, COUNT(*) count
FROM      BRAIN_STROKE
GROUP BY  gender
"""
pd.read_sql_query(query, conn)

   gender  count
0  Female   2907
1    Male   2074

2. What is the distribution of people with stroke in the dataset?

In [39]:
query = """
SELECT    stroke, COUNT(*) count
FROM      BRAIN_STROKE
GROUP BY  stroke
"""
pd.read_sql_query(query, conn)

   stroke  count
0       0   4733
1       1    248

3. What is the distribution of brain stroke by gender?

In [40]:
query = """
SELECT    gender, stroke, COUNT(*) count
FROM      BRAIN_STROKE
GROUP BY  gender, stroke
"""
pd.read_sql_query(query, conn)

   gender  stroke  count
0  Female       0   2767
1  Female       1    140
2    Male       0   1966
3    Male       1    108

4. For women, how many percent has stroke?

In [41]:
query = """
SELECT      gender, stroke, CAST(COUNT(*) AS FLOAT)/total.count * 100 AS Percent
FROM        BRAIN_STROKE, (SELECT COUNT(*) count FROM BRAIN_STROKE WHERE gender = 'Female') total
WHERE       gender = 'Female'
GROUP BY    stroke

UNION ALL

SELECT      gender, stroke, CAST(COUNT(*) AS FLOAT)/total.count * 100 AS Percent
FROM        BRAIN_STROKE, (SELECT COUNT(*) count FROM BRAIN_STROKE WHERE gender = 'Male') total
WHERE       gender = 'Male'
GROUP BY    stroke
"""
pd.read_sql_query(query, conn)

   gender  stroke    Percent
0  Female       0  95.184039
1  Female       1   4.815961
2    Male       0  94.792671
3    Male       1   5.207329

6. Details of the oldest people with stroke based on work type

In [42]:
query = """
WITH older_people AS (
    SELECT  *
    FROM    BRAIN_STROKE
    WHERE   age > 70
)

SELECT  gender, work_type, COUNT(*) count 
FROM    older_people
GROUP BY    gender, work_type
"""
pd.read_sql_query(query, conn)

   gender      work_type  count
0  Female       Govt_job     52
1  Female        Private    193
2  Female  Self-employed    175
3    Male       Govt_job     31
4    Male        Private    143
5    Male  Self-employed    113

7. How many people are married and has stroke?

In [43]:
query = """
SELECT  COUNT(*) Married_and_has_stroke
FROM    BRAIN_STROKE
WHERE   ever_married = 'Yes' AND stroke = 1
"""
pd.read_sql_query(query, conn)

   Married_and_has_stroke
0                     219

8. How many people are not married and has stroke?

In [44]:
query = """
SELECT  COUNT(*) Married_and_has_stroke
FROM    BRAIN_STROKE
WHERE   ever_married = 'No' AND stroke = 1
"""
pd.read_sql_query(query, conn)

   Married_and_has_stroke
0                      29

9. What is the minimum, average and maximum age in the data?

In [45]:
query = """
SELECT MAX(age) max_age, MIN(age) min_age, AVG(age) avg_age
  FROM BRAIN_STROKE
"""
pd.read_sql_query(query, conn)

   max_age  min_age    avg_age
0       82     0.08  43.419859

10. Details of people in the dataset below 10 years

In [46]:
query = """
SELECT *
  FROM BRAIN_STROKE
 WHERE age < 10
 LIMIT 10
"""
pd.read_sql_query(query, conn)

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Male,3.00,0,0,No,children,Rural,95.12,18.0,Unknown,0
1,Female,8.00,0,0,No,Private,Urban,110.89,17.6,Unknown,0
2,Female,3.00,0,0,No,children,Urban,73.74,16.0,Unknown,0
3,Male,4.00,0,0,No,children,Rural,79.17,20.0,Unknown,0
4,Male,8.00,0,0,No,children,Rural,78.05,25.7,Unknown,0
5,Female,0.64,0,0,No,children,Urban,83.82,24.9,Unknown,0
6,Female,4.00,0,0,No,children,Rural,93.25,16.6,Unknown,0
7,Female,0.88,0,0,No,children,Rural,88.11,15.5,Unknown,0
8,Male,4.00,0,0,No,children,Rural,106.22,16.7,Unknown,0
9,Male,5.00,0,0,No,children,Rural,85.84,16.4,Unknown,0

11. Number of children with either hypertension or stroke

In [47]:
query = """
SELECT  *
FROM    BRAIN_STROKE
WHERE   work_type = 'children' AND (hypertension = 1 OR stroke =1)
"""
pd.read_sql_query(query, conn)

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Female,14.00,0,0,No,children,Rural,57.93,30.9,Unknown,1
1,Female,1.32,0,0,No,children,Urban,70.37,18.7,Unknown,1

12. What's the distibution of hypertension in the dataset?

In [48]:
query = """
SELECT    hypertension, COUNT(*) count
FROM      BRAIN_STROKE
GROUP BY  hypertension
"""
pd.read_sql_query(query, conn)

   hypertension  count
0             0   4502
1             1    479

13. How many male, and female has hypertension?

In [49]:
query = """
SELECT    gender, hypertension, COUNT(*) count
FROM      BRAIN_STROKE
GROUP BY  gender, hypertension
"""
pd.read_sql_query(query, conn)

   gender  hypertension  count
0  Female             0   2643
1  Female             1    264
2    Male             0   1859
3    Male             1    215

14. For each smoking status show how many people have hypertension and how many do not?

In [50]:
query = """
SELECT    smoking_status, hypertension, COUNT(*) count
FROM      BRAIN_STROKE
GROUP BY  smoking_status, hypertension
"""
pd.read_sql_query(query, conn)

    smoking_status  hypertension  count
0          Unknown             0   1450
1          Unknown             1     50
2  formerly smoked             0    752
3  formerly smoked             1    115
4     never smoked             0   1615
5     never smoked             1    223
6           smokes             0    685
7           smokes             1     91

15. How many male, and female has both hypertension and heart disease?

In [51]:
query = """
SELECT  gender,COUNT(gender) as gender_count
FROM    BRAIN_STROKE
WHERE   hypertension = 1 AND heart_disease = 1
GROUP BY gender 
"""
pd.read_sql_query(query, conn)

   gender  gender_count
0  Female            29
1    Male            35

16. Which residence has the lowest number of people with no heart disease?

In [52]:
query = """
SELECT    Residence_type, heart_disease, COUNT(*) count
FROM      BRAIN_STROKE
WHERE     heart_disease = 0
GROUP BY  Residence_type
"""
pd.read_sql_query(query, conn)

  Residence_type  heart_disease  count
0          Rural              0   2315
1          Urban              0   2391

17. How many percent of people with private work type has no hypertension?

In [57]:
query = """
SELECT    work_type, hypertension, CAST(COUNT(*) AS FLOAT)/total.count * 100 AS Percent
FROM      BRAIN_STROKE, (SELECT COUNT(*) count FROM BRAIN_STROKE WHERE work_type = 'Private') total
WHERE     work_type = 'Private' AND hypertension = 0
GROUP BY  hypertension
"""
pd.read_sql_query(query, conn)

  work_type  hypertension   Percent
0   Private             0  90.48951

Summary

![](download.jfif)

* The brain stroke dataset was gotten from Kaggle
* Pandas was used to import the dataset and converted into a dataframe
* The dataset was queried using sqlite3

Findings

* There are 2907 females in the dataset, 140 of them have brain stroke while 2767 have no stroke.
* There are 2074 males in the dataset, 108 of them have brain stroke while 1966 have no stroke. 
* 219 people that are married have stroke and 29 people that are not married have stroke
* There are 2 children with stroke
* 264 females have hypertension and 215 males have hypertension
* 29 females and 35 males have both hypertension and heart disease
* The urban area has the highest number of people with no heart disease
* More than 90% of the people with private work type has no hypertension.